; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v8 - type_2 ?v4 - type_1)
 	      (pred_3 ?v6 - object ?v4 - type_1)
	      (pred_1 ?v8 - type_2 ?v7 - type_3)
	      (pred_2 ?v8 - type_2 ?v6 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v8 - type_2 ?v1 ?v2 - type_1)
       :precondition (and  (pred_4 ?v8 ?v1))
       :effect (and  (pred_4 ?v8 ?v2)
		     (not (pred_4 ?v8 ?v1))))

   (:action op_1
       :parameters (?v8 - type_2 ?v5 - object ?v3 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v3) (pred_4 ?v8 ?v3) (pred_1 ?v8 ?v7))
       :effect (and (pred_2 ?v8 ?v5 ?v7)
		    (not (pred_3 ?v5 ?v3)) 
		    (not (pred_1 ?v8 ?v7))))

   (:action op_3
       :parameters (?v8 - type_2 ?v5 - object ?v3 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v5 ?v7) (pred_4 ?v8 ?v3))
       :effect (and (pred_3 ?v5 ?v3)
		    (pred_1 ?v8 ?v7)
		    (not (pred_2 ?v8 ?v5 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_02 obj_03 - type_2
obj_09 obj_11 obj_06 obj_13 - type_3
obj_07 obj_10 obj_04 obj_12 - type_1
obj_05 obj_01 obj_08 - object)
(:init
(pred_4 obj_02 obj_12)
(pred_1 obj_02 obj_09)
(pred_1 obj_02 obj_11)
(pred_4 obj_03 obj_10)
(pred_1 obj_03 obj_06)
(pred_1 obj_03 obj_13)
(pred_3 obj_05 obj_04)
(pred_3 obj_01 obj_10)
(pred_3 obj_08 obj_12)
)
(:goal
(and
(pred_3 obj_05 obj_10)
(pred_3 obj_01 obj_07)
(pred_3 obj_08 obj_04)
)
)

(:constraints
  (always (not (pred_4 obj_02 obj_04)))
)
)

; plan
1. (op_1 obj_03 obj_01 obj_10 obj_13)
   deleted: (pred_3 obj_01 obj_10) (pred_1 obj_03 obj_13)
   added: (pred_2 obj_03 obj_01 obj_13)
   goals met: 0 of 3
2. (op_1 obj_02 obj_08 obj_12 obj_11)
   deleted: (pred_3 obj_08 obj_12) (pred_1 obj_02 obj_11)
   added: (pred_2 obj_02 obj_08 obj_11)
   goals met: 0 of 3
3. (op_2 obj_03 obj_10 obj_07)
   deleted: (pred_4 obj_03 obj_10)
   added: (pred_4 obj_03 obj_07)
   goals met: 0 of 3
4. (op_2 obj_02 obj_12 obj_10)
   deleted: (pred_4 obj_02 obj_12)
   added: (pred_4 obj_02 obj_10)
   goals met: 0 of 3
5. (op_3 obj_03 obj_01 obj_07 obj_13)
   deleted: (pred_2 obj_03 obj_01 obj_13)
   added: (pred_3 obj_01 obj_07) (pred_1 obj_03 obj_13)
   goals met: 1 of 3
6. (op_3 obj_02 obj_08 obj_10 obj_11)
   deleted: (pred_2 obj_02 obj_08 obj_11)
   added: (pred_3 obj_08 obj_10) (pred_1 obj_02 obj_11)
   goals met: 1 of 3
7. (op_2 obj_03 obj_07 obj_10)
   deleted: (pred_4 obj_03 obj_07)
   added: (pred_4 obj_03 obj_10)
   goals met: 1 of 3
8. (op_2 obj_03 obj_10 obj_04)
   deleted: (pred_4 obj_03 obj_10)
   added: (pred_4 obj_03 obj_04)
   goals met: 1 of 3
9. (op_1 obj_03 obj_05 obj_04 obj_13)
   deleted: (pred_3 obj_05 obj_04) (pred_1 obj_03 obj_13)
   added: (pred_2 obj_03 obj_05 obj_13)
   goals met: 1 of 3
10. (op_2 obj_03 obj_04 obj_10)
   deleted: (pred_4 obj_03 obj_04)
   added: (pred_4 obj_03 obj_10)
   goals met: 1 of 3
11. (op_3 obj_03 obj_05 obj_10 obj_13)
   deleted: (pred_2 obj_03 obj_05 obj_13)
   added: (pred_3 obj_05 obj_10) (pred_1 obj_03 obj_13)
   goals met: 2 of 3
12. (op_1 obj_03 obj_08 obj_10 obj_13)
   deleted: (pred_3 obj_08 obj_10) (pred_1 obj_03 obj_13)
   added: (pred_2 obj_03 obj_08 obj_13)
   goals met: 2 of 3
13. (op_2 obj_03 obj_10 obj_04)
   deleted: (pred_4 obj_03 obj_10)
   added: (pred_4 obj_03 obj_04)
   goals met: 2 of 3
14. (op_3 obj_03 obj_08 obj_04 obj_13)
   deleted: (pred_2 obj_03 obj_08 obj_13)
   added: (pred_3 obj_08 obj_04) (pred_1 obj_03 obj_13)
   goals met: 3 of 3
